{"v":"2.0.0","en":{"main":"MAIN","about_cin":"About CIN","tools_cin":"TOOLS CIN","compression_css":"CSS Compression","compression_js":"JS Compression","compression_json":"JSON Compression","compression_html":"HTML Compression","loading_message":"Loading CIN Framework...","status_badge":"🚀 Framework in Development","coming_soon":"Coming Soon!","coming_soon_subtitle":"This framework is not yet released. It will be available soon.","tagline":"CIN FRAMEWORK – WEB 4 – POWERED BY LOCAL SELF-SUFFICIENCY AND AGGRESSIVE SECURITY","subscription_title":"Get Early Access","email_placeholder":"Enter your email","notify_button":"Get Notified","info_title":"Development Status:","info_message":"CIN Framework is currently in active development. Join our mailing list to be the first to know when it's ready!","css_compressor_title":"CSS Code Compressor","js_compressor_title":"JavaScript Code Compressor","json_compressor_title":"JSON Code Compressor","html_compressor_title":"HTML Code Compressor","input_placeholder":"Paste your code here...","compress_button":"Compress","format_button":"Format","copy_button":"Copy","reset_button":"Reset","compression_success":"Code compressed successfully!","format_success":"Code formatted successfully!","copy_success":"Code copied to clipboard!","compression_error":"Error compressing code. Please check your input.","format_error":"Error formatting code. Please check your input.","input_css_title":"Input CSS Code","input_js_title":"Input JavaScript Code","input_json_title":"Input JSON Code","input_html_title":"Input HTML Code","output_css_title":"Compressed CSS Code","output_js_title":"Compressed JavaScript Code","output_json_title":"Compressed JSON Code","output_html_title":"Compressed HTML Code","original_css":"Original CSS","original_js":"Original JavaScript","original_json":"Original JSON","original_html":"Original HTML","compressed_css":"Compressed CSS","compressed_js":"Compressed JavaScript","compressed_json":"Compressed JSON","compressed_html":"Compressed HTML","css_features":"• Unlimited input size • Removes comments and whitespace • Optimizes selectors • Preserves functionality • Error-free compression","js_features":"• Unlimited input size • Removes comments and whitespace • Optimizes variable names • Preserves functionality • Error-free compression","json_features":"• Unlimited input size • Removes whitespace and formatting • Validates JSON syntax • Preserves data integrity • Error-free compression","html_features":"• Unlimited input size • Removes unnecessary whitespace • Preserves HTML structure • Optimizes attributes • Error-free compression","css_description":"Advanced CSS compression tool with unlimited input size and error-free compression","js_description":"Advanced JavaScript compression tool with unlimited input size and error-free compression","json_description":"Advanced JSON compression tool with unlimited input size and error-free compression","html_description":"Advanced HTML compression tool with unlimited input size and structure-preserving compression","features_title":"Features","about_hero_badge":"👁️‍🗨️ What is CIN FRAMEWORK?","about_title":"CIN FRAMEWORK","about_intro":"CIN FRAMEWORK is not just a framework.<br>It is an integrated system, a diabolical engineering entity that brings together all the tools, libraries, and technologies that any programmer needs to create a professional web application with global standards, without limits, without restrictions, and without complexity.","about_description":"It is not like other boring frameworks... but an aggressive electronic system that improves performance, controls architecture, and unleashes the power of execution speed and development flexibility.<br>It is designed to work in any server environment, giving you absolute stability and aggressive security that we call:<br><strong>\"Aggressive Security\" — where we don't just defend... we attack.</strong>","about_goal_title":"🎯 CIN Goal: Control, Speed, Liquidity","about_goal_content":"CIN was built to provide an integrated web development environment that knows no collapse and accepts no delay.<br>Our goal is to create an electronic world not limited by PHP structure, but harnesses it for your benefit.<br>Aggressive speed, deep integration, comprehensive analysis, diabolical customization...<br>All of this comes to you on a platter of ease, through CIN.<br><br><strong>With CIN... you won't just develop an application, you'll enter the era of the fourth generation of the web – Web 4.</strong>","about_target_title":"👤 Who is CIN designed for?","about_target_content":"Whether you are:<br><br>• A beginner who has never set foot in programming,<br>• Or a professional programmer looking for more stable ground,<br>• Or a huge company that wants an electronic weapon that guarantees its security...<br><br><strong>CIN is designed for you.</strong><br><br>Smooth learning, detailed explanation, videos, articles, and direct support that guides you step by step.<br>From backend to frontend... from zero to full stack, without pain or waiting.","about_comparison_title":"🆚 Is CIN like Laravel or Symfony?","about_comparison_content":"<strong>CIN is incomparable.</strong><br>Because it is not a framework, but a complete web application in itself.<br>All you need is to change the content and identity...<br>And you won't need prior knowledge of programming, or even the arts of system architecture.<br><br><strong>CIN = Code In Nothing</strong><br><br>Code is nothing... the system is everything.","about_philosophy_title":"🔮 CIN Philosophy: Speed. Stability. Sovereignty.","about_philosophy_content":"We are in an era where those who are late are punished.<br>Therefore, CIN believes that every programmer has the right to own a giant infrastructure that serves their interests and gives them steel stability.<br><br>We do not monopolize code.<br>We do not hide knowledge.<br>But we give it to you on a platter of fire... to build what you want, and dominate as you wish.","about_features_title":"🚀 CIN's Killer Features","about_feature_1_title":"🔥 Easy Learning","about_feature_1_desc":"You will understand everything quickly, and build faster than you imagine.","about_feature_2_title":"🧠 Multi-Environment Support","about_feature_2_desc":"Whatever your server environment, CIN adapts.","about_feature_3_title":"🛡️ Aggressive Security","about_feature_3_desc":"No room for vulnerabilities... CIN attacks before being attacked.","about_feature_4_title":"⚡ Parallel Execution","about_feature_4_desc":"Speed at the heart of architecture.","about_feature_5_title":"🔍 Search Engine Support","about_feature_5_desc":"Everything is calculated, even your Google results.","about_feature_6_title":"🧬 CIN Now","about_feature_6_desc":"No testing, just launch. We are in the field from the first moment.","about_future_title":"🧠 The Future: Where Every New Developer is Born","about_future_content":"We see CIN as a source of power for every ambitious young person who did not have the opportunity to study engineering or complex programming systems.<br>With CIN, you won't need prior knowledge, or certificates.<br>Just follow the instructions, and own the interface, background, and beating heart of your website.","about_final_title":"📜 CIN FRAMEWORK – WEB 4","about_final_content":"We use local self-sufficiency technology and aggressive security.<br>And with us... the new phase of control begins.","search_placeholder":"Search...","no_results":"No results found","privacy_policy":"Privacy Policy","privacy_hero_badge":"🔐 CIN FRAMEWORK Privacy Policy","privacy_title":"Privacy Policy","privacy_intro":"Within the CIN FRAMEWORK, we place utmost importance on respecting your privacy and protecting your personal data. We fully recognize that the information you provide to us is not just data, but an extension of your digital existence, and our responsibility towards you requires complete transparency regarding how this information is used, its purpose, and the parties that may access it.","privacy_description":"This page aims to clarify the privacy policy we follow, the measures taken to protect your information, and the options available to you regarding your data. By using our website or any of our services, you implicitly agree to all the practices and policies outlined below.","privacy_section_1_title":"First: Information We Collect","privacy_section_1_content":"We collect multiple types of data when you interact with our platform, including the following:<br><br><strong>1. Information you provide voluntarily:</strong><br>When registering on the site or subscribing to our newsletter or contacting us, we may ask for identifying information such as: full name, email address, job title, company name, country, or other details.<br><br><strong>2. Technical information collected automatically:</strong><br>• Internet Protocol (IP) address<br>• Device type and operating system<br>• Browser type and version<br>• Pages you visit, duration of stay, and access dates<br>• User behavior within the site<br><br><strong>3. Cookies:</strong><br>We use advanced tracking technologies to analyze user behavior within the platform, customize their experience, and improve our services based on actual interaction.","privacy_section_2_title":"Second: How We Use This Data?","privacy_section_2_content":"We use the data we collect within the CIN FRAMEWORK for the following purposes:<br><br>• To improve user experience and develop content that aligns with visitors' interests<br>• To provide customized services based on user type (beginner, professional, company)<br>• To respond to inquiries and technical or administrative support<br>• To send updates, announcements, educational articles, or technical offers via email<br>• For internal analytical purposes including performance tracking and evaluating platform strengths and weaknesses<br>• To ensure security and prevent any unauthorized or illegal activity","privacy_section_3_title":"Third: Data Protection and Security","privacy_section_3_content":"We take information security very seriously. We have integrated a set of strict security measures — technical and organizational — to protect user data from any unauthorized access, modification, loss, or destruction, including but not limited to:<br><br>• Using strong encryption protocols for data transmission<br>• Firewalls and anti-intrusion systems<br>• Proactive monitoring systems for abnormal behavior within the system<br>• Limited permissions within the backend infrastructure, so access is only available to authorized personnel","privacy_section_4_title":"Fourth: Data Sharing with Third Parties","privacy_section_4_content":"In general, we do not sell, rent, or share your personal information with any third party. However, we may share some data in the following cases:<br><br>• With companies or providers we work with to improve services (with full commitment not to use them for commercial purposes)<br>• If legally required based on an official request from competent authorities<br>• To protect our rights or enforce terms of use or to detect fraudulent activities or security threats","privacy_section_5_title":"Fifth: User Rights","privacy_section_5_content":"We give you complete control over your data. You have the right to:<br><br>• Request a copy of your personal data stored with us<br>• Request correction of any error or modification of your data<br>• Request permanent deletion of all your data<br>• Withdraw your consent to use your data at any time<br><br>You can exercise these rights by contacting us directly via the following email:<br>📧 support@cin-framework.com","privacy_section_6_title":"Sixth: Use of Cookies","privacy_section_6_content":"We use cookies to provide a better and more personalized experience, and these files include:<br><br>• Session Cookies<br>• Analytics Cookies<br>• Customization and preference files<br><br>You can control cookies through your browser settings, but disabling them may affect some site features.","privacy_section_7_title":"Seventh: Data Retention Period","privacy_section_7_content":"We retain your data as long as it is necessary for the purposes for which it was collected, or as long as your account is active, or as required by law. After that, the data is permanently deleted or made untraceable.","privacy_section_8_title":"Eighth: Privacy Policy Modifications","privacy_section_8_content":"We may update this policy at any time, and your continued use of the site after modifications constitutes implicit consent to the modified version. We recommend reviewing this page periodically.<br><br>Last update to this policy: August 6, 2025","privacy_section_9_title":"Ninth: Contact Us","privacy_section_9_content":"For any inquiry, complaint, or request related to your data, you can contact us via the official email:<br>📧 privacy@cin-framework.com<br><br>Or via the general technical support email:<br>📧 contact@cin-framework.com","privacy_final_title":"CIN FRAMEWORK - Digital Control","privacy_final_content":"We at CIN FRAMEWORK believe that knowledge is power…<br>But data — when used intelligently — is the key to control.<br>And everyone who enters our digital domain, we grant them apparent security… and control them in secret."}}